;; -*- no-byte-compile: t; -*-

(package! terminal-here)
(package! auto-save-buffers-enhanced)

;; disable evil-escape jk
(package! evil-escape :disable t)


;;; Scala packages
(package! scala-mode)
(package! sbt-mode)
(package! lsp-metals)
(package! lsp-ui)
(package! company-lsp)
(package! posframe)
;; (package! dapmode)
(package! yasnippet)

(package! lsp-mode)

(package! org-noter)
(package! org-ref)
(package! helm-bibtex)
